; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	image3 - mode
	infrared2 - mode
	spectrograph1 - mode
	infrared0 - mode
	thermograph4 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star9 - direction
	Star21 - direction
	GroundStation22 - direction
	GroundStation23 - direction
	GroundStation29 - direction
	GroundStation46 - direction
	GroundStation6 - direction
	Star41 - direction
	Star8 - direction
	Star45 - direction
	Star11 - direction
	Star10 - direction
	GroundStation39 - direction
	GroundStation36 - direction
	GroundStation13 - direction
	GroundStation18 - direction
	GroundStation20 - direction
	GroundStation25 - direction
	GroundStation7 - direction
	Star42 - direction
	GroundStation26 - direction
	Star24 - direction
	GroundStation47 - direction
	Star35 - direction
	GroundStation19 - direction
	GroundStation33 - direction
	Star43 - direction
	Star38 - direction
	GroundStation15 - direction
	GroundStation5 - direction
	Star34 - direction
	GroundStation49 - direction
	GroundStation44 - direction
	GroundStation12 - direction
	GroundStation27 - direction
	GroundStation37 - direction
	GroundStation17 - direction
	GroundStation31 - direction
	Star4 - direction
	GroundStation30 - direction
	Star16 - direction
	Star40 - direction
	Star3 - direction
	Star48 - direction
	Star32 - direction
	GroundStation14 - direction
	GroundStation28 - direction
	Phenomenon50 - direction
	Planet51 - direction
	Planet52 - direction
	Planet53 - direction
	Phenomenon54 - direction
	Planet55 - direction
	Phenomenon56 - direction
	Star57 - direction
	Planet58 - direction
	Star59 - direction
	Planet60 - direction
	Phenomenon61 - direction
	Phenomenon62 - direction
	Planet63 - direction
	Planet64 - direction
	Star65 - direction
	Star66 - direction
	Phenomenon67 - direction
	Star68 - direction
	Planet69 - direction
	Planet70 - direction
	Planet71 - direction
	Planet72 - direction
	Phenomenon73 - direction
	Planet74 - direction
	Star75 - direction
	Phenomenon76 - direction
	Planet77 - direction
	Phenomenon78 - direction
	Phenomenon79 - direction
	Planet80 - direction
	Phenomenon81 - direction
	Phenomenon82 - direction
	Star83 - direction
	Phenomenon84 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star45)
	(calibration_target instrument0 GroundStation47)
	(calibration_target instrument0 GroundStation19)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star16)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 GroundStation18)
	(calibration_target instrument0 Star42)
	(calibration_target instrument0 GroundStation49)
	(calibration_target instrument0 Star41)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star43)
	(calibration_target instrument0 Star24)
	(calibration_target instrument0 Star35)
	(calibration_target instrument0 GroundStation15)
	(calibration_target instrument0 Star10)
	(supports instrument1 image3)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon73)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star45)
	(calibration_target instrument2 Star43)
	(calibration_target instrument2 GroundStation20)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation28)
	(calibration_target instrument3 GroundStation15)
	(calibration_target instrument3 GroundStation30)
	(calibration_target instrument3 GroundStation31)
	(calibration_target instrument3 GroundStation36)
	(calibration_target instrument3 GroundStation39)
	(calibration_target instrument3 GroundStation26)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation49)
	(supports instrument4 image3)
	(calibration_target instrument4 Star42)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation28)
	(calibration_target instrument4 GroundStation26)
	(calibration_target instrument4 GroundStation37)
	(calibration_target instrument4 GroundStation19)
	(calibration_target instrument4 GroundStation25)
	(calibration_target instrument4 GroundStation20)
	(calibration_target instrument4 GroundStation27)
	(calibration_target instrument4 GroundStation18)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 Star43)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 GroundStation44)
	(calibration_target instrument4 Star48)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star65)
	(supports instrument5 thermograph4)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation47)
	(calibration_target instrument5 GroundStation44)
	(calibration_target instrument5 Star24)
	(calibration_target instrument5 GroundStation26)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star38)
	(calibration_target instrument6 GroundStation12)
	(calibration_target instrument6 Star43)
	(calibration_target instrument6 GroundStation33)
	(calibration_target instrument6 GroundStation19)
	(calibration_target instrument6 Star32)
	(calibration_target instrument6 Star16)
	(calibration_target instrument6 GroundStation31)
	(calibration_target instrument6 Star35)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star16)
	(calibration_target instrument7 GroundStation30)
	(calibration_target instrument7 Star32)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation31)
	(calibration_target instrument7 GroundStation17)
	(calibration_target instrument7 GroundStation37)
	(calibration_target instrument7 GroundStation28)
	(calibration_target instrument7 GroundStation27)
	(calibration_target instrument7 GroundStation12)
	(calibration_target instrument7 GroundStation44)
	(calibration_target instrument7 GroundStation49)
	(calibration_target instrument7 Star34)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 GroundStation15)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation6)
	(supports instrument8 image3)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation28)
	(calibration_target instrument8 GroundStation14)
	(calibration_target instrument8 Star32)
	(calibration_target instrument8 Star48)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star40)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon81)
)
(:goal (and
	(pointing satellite0 Star35)
	(pointing satellite1 GroundStation47)
	(pointing satellite3 GroundStation1)
	(have_image Phenomenon50 thermograph4)
	(have_image Planet51 spectrograph1)
	(have_image Planet52 thermograph4)
	(have_image Planet53 image3)
	(have_image Phenomenon54 infrared2)
	(have_image Planet55 infrared0)
	(have_image Phenomenon56 infrared0)
	(have_image Star57 image3)
	(have_image Planet58 infrared0)
	(have_image Star59 image3)
	(have_image Planet60 spectrograph1)
	(have_image Phenomenon61 infrared0)
	(have_image Phenomenon62 infrared2)
	(have_image Planet63 thermograph4)
	(have_image Planet64 infrared2)
	(have_image Star65 spectrograph1)
	(have_image Star66 image3)
	(have_image Phenomenon67 image3)
	(have_image Star68 image3)
	(have_image Planet69 image3)
	(have_image Planet70 infrared2)
	(have_image Planet71 image3)
	(have_image Planet72 infrared2)
	(have_image Phenomenon73 infrared0)
	(have_image Planet74 spectrograph1)
	(have_image Star75 infrared0)
	(have_image Phenomenon76 thermograph4)
	(have_image Planet77 image3)
	(have_image Phenomenon78 infrared0)
	(have_image Phenomenon79 infrared0)
	(have_image Planet80 spectrograph1)
	(have_image Phenomenon81 thermograph4)
	(have_image Phenomenon82 infrared2)
	(have_image Star83 infrared0)
	(have_image Phenomenon84 thermograph4)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 38
2. (turn_to satellite3 groundstation1 groundstation6)
   deleted: (pointing satellite3 groundstation6)
   added: (pointing satellite3 groundstation1)
   goals met: 1 of 38
3. (turn_to satellite1 groundstation39 groundstation49)
   deleted: (pointing satellite1 groundstation49)
   added: (pointing satellite1 groundstation39)
   goals met: 1 of 38
4. (calibrate satellite1 instrument3 groundstation39)
   added: (calibrated instrument3)
   goals met: 1 of 38
5. (turn_to satellite1 groundstation47 groundstation39)
   deleted: (pointing satellite1 groundstation39)
   added: (pointing satellite1 groundstation47)
   goals met: 2 of 38
6. (turn_to satellite0 phenomenon50 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 phenomenon50)
   goals met: 2 of 38
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 38
8. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 2 of 38
9. (turn_to satellite4 planet51 phenomenon81)
   deleted: (pointing satellite4 phenomenon81)
   added: (pointing satellite4 planet51)
   goals met: 2 of 38
10. (turn_to satellite4 star48 planet51)
   deleted: (pointing satellite4 planet51)
   added: (pointing satellite4 star48)
   goals met: 2 of 38
11. (calibrate satellite4 instrument8 star48)
   added: (calibrated instrument8)
   goals met: 2 of 38
12. (turn_to satellite4 phenomenon67 star48)
   deleted: (pointing satellite4 star48)
   added: (pointing satellite4 phenomenon67)
   goals met: 2 of 38
13. (take_image satellite4 phenomenon67 instrument8 image3)
   added: (have_image phenomenon67 image3)
   goals met: 3 of 38
14. (turn_to satellite4 planet51 phenomenon67)
   deleted: (pointing satellite4 phenomenon67)
   added: (pointing satellite4 planet51)
   goals met: 3 of 38
15. (take_image satellite4 planet51 instrument8 spectrograph1)
   added: (have_image planet51 spectrograph1)
   goals met: 4 of 38
16. (turn_to satellite4 planet53 planet51)
   deleted: (pointing satellite4 planet51)
   added: (pointing satellite4 planet53)
   goals met: 4 of 38
17. (take_image satellite4 planet53 instrument8 image3)
   added: (have_image planet53 image3)
   goals met: 5 of 38
18. (turn_to satellite4 planet60 planet53)
   deleted: (pointing satellite4 planet53)
   added: (pointing satellite4 planet60)
   goals met: 5 of 38
19. (take_image satellite4 planet60 instrument8 spectrograph1)
   added: (have_image planet60 spectrograph1)
   goals met: 6 of 38
20. (turn_to satellite4 planet69 planet60)
   deleted: (pointing satellite4 planet60)
   added: (pointing satellite4 planet69)
   goals met: 6 of 38
21. (take_image satellite4 planet69 instrument8 image3)
   added: (have_image planet69 image3)
   goals met: 7 of 38
22. (turn_to satellite4 planet71 planet69)
   deleted: (pointing satellite4 planet69)
   added: (pointing satellite4 planet71)
   goals met: 7 of 38
23. (take_image satellite4 planet71 instrument8 image3)
   added: (have_image planet71 image3)
   goals met: 8 of 38
24. (turn_to satellite4 planet74 planet71)
   deleted: (pointing satellite4 planet71)
   added: (pointing satellite4 planet74)
   goals met: 8 of 38
25. (take_image satellite4 planet74 instrument8 spectrograph1)
   added: (have_image planet74 spectrograph1)
   goals met: 9 of 38
26. (turn_to satellite4 planet77 planet74)
   deleted: (pointing satellite4 planet74)
   added: (pointing satellite4 planet77)
   goals met: 9 of 38
27. (take_image satellite4 planet77 instrument8 image3)
   added: (have_image planet77 image3)
   goals met: 10 of 38
28. (turn_to satellite4 planet80 planet77)
   deleted: (pointing satellite4 planet77)
   added: (pointing satellite4 planet80)
   goals met: 10 of 38
29. (take_image satellite4 planet80 instrument8 spectrograph1)
   added: (have_image planet80 spectrograph1)
   goals met: 11 of 38
30. (turn_to satellite4 star57 planet80)
   deleted: (pointing satellite4 planet80)
   added: (pointing satellite4 star57)
   goals met: 11 of 38
31. (take_image satellite4 star57 instrument8 image3)
   added: (have_image star57 image3)
   goals met: 12 of 38
32. (turn_to satellite4 star59 star57)
   deleted: (pointing satellite4 star57)
   added: (pointing satellite4 star59)
   goals met: 12 of 38
33. (take_image satellite4 star59 instrument8 image3)
   added: (have_image star59 image3)
   goals met: 13 of 38
34. (turn_to satellite4 star65 star59)
   deleted: (pointing satellite4 star59)
   added: (pointing satellite4 star65)
   goals met: 13 of 38
35. (take_image satellite4 star65 instrument8 spectrograph1)
   added: (have_image star65 spectrograph1)
   goals met: 14 of 38
36. (turn_to satellite4 star66 star65)
   deleted: (pointing satellite4 star65)
   added: (pointing satellite4 star66)
   goals met: 14 of 38
37. (take_image satellite4 star66 instrument8 image3)
   added: (have_image star66 image3)
   goals met: 15 of 38
38. (turn_to satellite4 star68 star66)
   deleted: (pointing satellite4 star66)
   added: (pointing satellite4 star68)
   goals met: 15 of 38
39. (take_image satellite4 star68 instrument8 image3)
   added: (have_image star68 image3)
   goals met: 16 of 38
40. (turn_to satellite1 phenomenon56 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 phenomenon56)
   goals met: 15 of 38
41. (take_image satellite1 phenomenon56 instrument3 infrared0)
   added: (have_image phenomenon56 infrared0)
   goals met: 16 of 38
42. (turn_to satellite1 groundstation47 phenomenon56)
   deleted: (pointing satellite1 phenomenon56)
   added: (pointing satellite1 groundstation47)
   goals met: 17 of 38
43. (turn_to satellite1 phenomenon61 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 phenomenon61)
   goals met: 16 of 38
44. (take_image satellite1 phenomenon61 instrument3 infrared0)
   added: (have_image phenomenon61 infrared0)
   goals met: 17 of 38
45. (turn_to satellite1 groundstation47 phenomenon61)
   deleted: (pointing satellite1 phenomenon61)
   added: (pointing satellite1 groundstation47)
   goals met: 18 of 38
46. (turn_to satellite1 phenomenon73 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 phenomenon73)
   goals met: 17 of 38
47. (take_image satellite1 phenomenon73 instrument3 infrared0)
   added: (have_image phenomenon73 infrared0)
   goals met: 18 of 38
48. (turn_to satellite1 groundstation47 phenomenon73)
   deleted: (pointing satellite1 phenomenon73)
   added: (pointing satellite1 groundstation47)
   goals met: 19 of 38
49. (turn_to satellite1 phenomenon78 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 phenomenon78)
   goals met: 18 of 38
50. (take_image satellite1 phenomenon78 instrument3 infrared0)
   added: (have_image phenomenon78 infrared0)
   goals met: 19 of 38
51. (turn_to satellite1 groundstation47 phenomenon78)
   deleted: (pointing satellite1 phenomenon78)
   added: (pointing satellite1 groundstation47)
   goals met: 20 of 38
52. (turn_to satellite1 phenomenon79 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 phenomenon79)
   goals met: 19 of 38
53. (take_image satellite1 phenomenon79 instrument3 infrared0)
   added: (have_image phenomenon79 infrared0)
   goals met: 20 of 38
54. (turn_to satellite1 groundstation47 phenomenon79)
   deleted: (pointing satellite1 phenomenon79)
   added: (pointing satellite1 groundstation47)
   goals met: 21 of 38
55. (turn_to satellite1 planet55 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 planet55)
   goals met: 20 of 38
56. (take_image satellite1 planet55 instrument3 infrared0)
   added: (have_image planet55 infrared0)
   goals met: 21 of 38
57. (turn_to satellite1 groundstation47 planet55)
   deleted: (pointing satellite1 planet55)
   added: (pointing satellite1 groundstation47)
   goals met: 22 of 38
58. (turn_to satellite1 planet58 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 planet58)
   goals met: 21 of 38
59. (take_image satellite1 planet58 instrument3 infrared0)
   added: (have_image planet58 infrared0)
   goals met: 22 of 38
60. (turn_to satellite1 groundstation47 planet58)
   deleted: (pointing satellite1 planet58)
   added: (pointing satellite1 groundstation47)
   goals met: 23 of 38
61. (turn_to satellite1 star75 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 star75)
   goals met: 22 of 38
62. (take_image satellite1 star75 instrument3 infrared0)
   added: (have_image star75 infrared0)
   goals met: 23 of 38
63. (turn_to satellite1 groundstation47 star75)
   deleted: (pointing satellite1 star75)
   added: (pointing satellite1 groundstation47)
   goals met: 24 of 38
64. (turn_to satellite1 star83 groundstation47)
   deleted: (pointing satellite1 groundstation47)
   added: (pointing satellite1 star83)
   goals met: 23 of 38
65. (take_image satellite1 star83 instrument3 infrared0)
   added: (have_image star83 infrared0)
   goals met: 24 of 38
66. (turn_to satellite1 groundstation47 star83)
   deleted: (pointing satellite1 star83)
   added: (pointing satellite1 groundstation47)
   goals met: 25 of 38
67. (turn_to satellite0 star8 phenomenon50)
   deleted: (pointing satellite0 phenomenon50)
   added: (pointing satellite0 star8)
   goals met: 25 of 38
68. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 25 of 38
69. (turn_to satellite0 phenomenon50 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon50)
   goals met: 25 of 38
70. (take_image satellite0 phenomenon50 instrument1 thermograph4)
   added: (have_image phenomenon50 thermograph4)
   goals met: 26 of 38
71. (turn_to satellite0 phenomenon54 phenomenon50)
   deleted: (pointing satellite0 phenomenon50)
   added: (pointing satellite0 phenomenon54)
   goals met: 26 of 38
72. (take_image satellite0 phenomenon54 instrument1 infrared2)
   added: (have_image phenomenon54 infrared2)
   goals met: 27 of 38
73. (turn_to satellite0 phenomenon62 phenomenon54)
   deleted: (pointing satellite0 phenomenon54)
   added: (pointing satellite0 phenomenon62)
   goals met: 27 of 38
74. (take_image satellite0 phenomenon62 instrument1 infrared2)
   added: (have_image phenomenon62 infrared2)
   goals met: 28 of 38
75. (turn_to satellite0 phenomenon76 phenomenon62)
   deleted: (pointing satellite0 phenomenon62)
   added: (pointing satellite0 phenomenon76)
   goals met: 28 of 38
76. (take_image satellite0 phenomenon76 instrument1 thermograph4)
   added: (have_image phenomenon76 thermograph4)
   goals met: 29 of 38
77. (turn_to satellite0 phenomenon81 phenomenon76)
   deleted: (pointing satellite0 phenomenon76)
   added: (pointing satellite0 phenomenon81)
   goals met: 29 of 38
78. (take_image satellite0 phenomenon81 instrument1 thermograph4)
   added: (have_image phenomenon81 thermograph4)
   goals met: 30 of 38
79. (turn_to satellite0 phenomenon82 phenomenon81)
   deleted: (pointing satellite0 phenomenon81)
   added: (pointing satellite0 phenomenon82)
   goals met: 30 of 38
80. (take_image satellite0 phenomenon82 instrument1 infrared2)
   added: (have_image phenomenon82 infrared2)
   goals met: 31 of 38
81. (turn_to satellite0 phenomenon84 phenomenon82)
   deleted: (pointing satellite0 phenomenon82)
   added: (pointing satellite0 phenomenon84)
   goals met: 31 of 38
82. (take_image satellite0 phenomenon84 instrument1 thermograph4)
   added: (have_image phenomenon84 thermograph4)
   goals met: 32 of 38
83. (turn_to satellite0 planet52 phenomenon84)
   deleted: (pointing satellite0 phenomenon84)
   added: (pointing satellite0 planet52)
   goals met: 32 of 38
84. (take_image satellite0 planet52 instrument1 thermograph4)
   added: (have_image planet52 thermograph4)
   goals met: 33 of 38
85. (turn_to satellite0 planet63 planet52)
   deleted: (pointing satellite0 planet52)
   added: (pointing satellite0 planet63)
   goals met: 33 of 38
86. (take_image satellite0 planet63 instrument1 thermograph4)
   added: (have_image planet63 thermograph4)
   goals met: 34 of 38
87. (turn_to satellite0 planet64 planet63)
   deleted: (pointing satellite0 planet63)
   added: (pointing satellite0 planet64)
   goals met: 34 of 38
88. (take_image satellite0 planet64 instrument1 infrared2)
   added: (have_image planet64 infrared2)
   goals met: 35 of 38
89. (turn_to satellite0 planet70 planet64)
   deleted: (pointing satellite0 planet64)
   added: (pointing satellite0 planet70)
   goals met: 35 of 38
90. (take_image satellite0 planet70 instrument1 infrared2)
   added: (have_image planet70 infrared2)
   goals met: 36 of 38
91. (turn_to satellite0 planet72 planet70)
   deleted: (pointing satellite0 planet70)
   added: (pointing satellite0 planet72)
   goals met: 36 of 38
92. (take_image satellite0 planet72 instrument1 infrared2)
   added: (have_image planet72 infrared2)
   goals met: 37 of 38
93. (turn_to satellite0 star35 planet72)
   deleted: (pointing satellite0 planet72)
   added: (pointing satellite0 star35)
   goals met: 38 of 38
